import libraies

In [70]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

Series 约等于 indexed dictionary

In [71]:
dict_ex = {"a": 1, "b": 2, "c": 3}
series = Series(dict_ex)
series
# dtype: int64

a    1
b    2
c    3
dtype: int64

In [72]:
new_index = ["a", "b", "c", "d"]
series_new = Series(dict_ex, index=new_index)
series_new
# dtype: float64, b/c NaN is considered as float

a    1.0
b    2.0
c    3.0
d    NaN
dtype: float64

In [73]:
series_new[1:3]

b    2.0
c    3.0
dtype: float64

In [74]:
series1 = Series(["a", "b", "c", "d"])
series1

# del will modify the original Series
# drop will return a new object. The original series won't be changed . (Unless inplace=true)

0    a
1    b
2    c
3    d
dtype: object

DataFrame is table like

Can be row-indexed and column-indexed

In [75]:
data = {
    "name": ["john", "jose", "dan", "jane"],
    "score": [80, 43, 90, 100],
    "course": ["math", "math", "english", "english"]
}
frame = DataFrame(data)
frame

   name  score   course
0  john     80     math
1  jose     43     math
2   dan     90  english
3  jane    100  english

In [76]:
frame.values

array([['john', 80, 'math'],
       ['jose', 43, 'math'],
       ['dan', 90, 'english'],
       ['jane', 100, 'english']], dtype=object)

In [77]:
frame.shape

(4, 3)

In [78]:
frame.index

RangeIndex(start=0, stop=4, step=1)

In [79]:
s0 = Series([234, 235, 435])
s1 = Series([1, 0, 0])
frame1 = DataFrame({"column0": s0, "column1": s1})
frame1

   column0  column1
0      234        1
1      235        0
2      435        0

In [80]:
# loc: params are names
# iloc: params are indexes

# drop will delete rows (axis default = 0)
# axis = 1 will delete columns
# pop will delete columns, cannot delete rows

def multiple_by_2(score: int) -> bool:
    return score * 2
s: Series = frame["score"].apply(multiple_by_2)
# this is so much faster than loops. 
# this is done in parallel
s

0    160
1     86
2    180
3    200
Name: score, dtype: int64

Pandas:

- I/O
- Groupby
- Merge and concat
- Missing value and Outlier Data

In [81]:
file_path = "./data/example.csv"
df = pd.read_csv(file_path, sep=",", header=0)
print(df.shape, df.dtypes)

df[:5].to_csv("./data/sliced.csv", index=False)

(14, 2) name     object
score     int64
dtype: object

In [82]:
df.head(3)

  name  score
0    a    100
1    b     33
2    c     89

In [83]:
df.tail(4)

   name  score
10    k     70
11    a     90
12    b     50
13    c     77

In [84]:
df.describe()

            score
count   14.000000
mean    66.642857
std     25.463721
min     33.000000
25%     45.000000
50%     63.000000
75%     89.750000
max    100.000000

In [85]:
df.sort_values(by="score", ascending=False)

   name  score
0     a    100
8     i    100
9     j     99
11    a     90
2     c     89
13    c     77
10    k     70
4     e     56
12    b     50
3     d     45
5     f     45
7     h     45
6     g     34
1     b     33

In [86]:
df[(df["score"] > 60) & (df["score"] < 95)]

   name  score
2     c     89
10    k     70
11    a     90
13    c     77

Groupby

- Splitting the data into groups based on some criteria
- Applying a funciotn to each group indenpendently
- Combining the results into a data structure

In [87]:
grouped = df.groupby(["name"])
type(grouped)

pandas.core.groupby.generic.DataFrameGroupBy

In [88]:
grouped.size()

name
a    2
b    2
c    2
d    1
e    1
f    1
g    1
h    1
i    1
j    1
k    1
dtype: int64

In [89]:
grouped["score"].mean().head(5)

name
a    95.0
b    41.5
c    83.0
d    45.0
e    56.0
Name: score, dtype: float64